/**
 * ==============================================================
 * @file            App.vue
 * @layer           -
 * @version         1.0.0
 * @since           2025-10-07
 * @author          พชร ไพศรีสกุล
 * @lastModified    2026-02-06
 * @lastModifiedBy  พชร ไพศรีสกุล
 * ---------------------------------------------------------------------
 * @description
 * นำเข้า icon ต่างๆ
 *
 *
 * ---------------------------------------------------------------------
 * @changelog
 * - [2025-10-17 ,พชร ไพศรีสกุล]
 * - [2025-10-18 ,พชร ไพศรีสกุล]
 * - [2025-10-21 ,พชร ไพศรีสกุล]
 * - [2025-10-22 ,พชร ไพศรีสกุล]
 * - [2026-02-05 ,พชร ไพศรีสกุล]
 * ==============================================================
 */

<script setup>
import { RouterView } from 'vue-router'

</script>

<template>
  <!-- App.vue แค่เป็น container -->
  <RouterView />
</template>
