/**
 * ==============================================================
 * @file            postcss.config.js
 * @layer           -
 * @version         1.0.0
 * @since           2025-10-18
 * @author          พชร ไพศรีสกุล
 *
 * ---------------------------------------------------------------------
 * @description
 * ตั้งค่า PostCSS โดยใช้ Tailwind CSS สำหรับจัดการสไตล์ 
 * และ Autoprefixer เพื่อเพิ่ม prefix ให้รองรับ browser ต่างๆ อัตโนมัติ
 * 
 * ---------------------------------------------------------------------
 * @changelog
 * - [2025-10-18 ,พชร ไพศรีสกุล]
 * ==============================================================
 */

export default {
  plugins: {
    tailwindcss: {},
    autoprefixer: {},
  },
}
